GopalSaraf/Practicals/PSDL/include/proc/pic16f18115.h
// Register: SCANTRIG
#define SCANTRIG SCANTRIG
extern volatile unsigned char           SCANTRIG            __at(0x1C99);
#ifndef _LIB_BUILD
asm("SCANTRIG equ 01C99h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TSEL                   :4;
    };
} SCANTRIGbits_t;
extern volatile SCANTRIGbits_t SCANTRIGbits __at(0x1C99);
// bitfield macros
#define _SCANTRIG_TSEL_POSN                                 0x0
#define _SCANTRIG_TSEL_POSITION                             0x0
#define _SCANTRIG_TSEL_SIZE                                 0x4
#define _SCANTRIG_TSEL_LENGTH                               0x4
#define _SCANTRIG_TSEL_MASK                                 0xF

// Register: CRCDATA
#define CRCDATA CRCDATA
extern volatile unsigned long           CRCDATA             __at(0x1C9A);
#ifndef _LIB_BUILD
asm("CRCDATA equ 01C9Ah");
#endif

// Register: CRCDATAL
#define CRCDATAL CRCDATAL
extern volatile unsigned char           CRCDATAL            __at(0x1C9A);
#ifndef _LIB_BUILD
asm("CRCDATAL equ 01C9Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DATA                   :8;
    };
    struct {
        unsigned DATA0                  :1;
        unsigned DATA1                  :1;
        unsigned DATA2                  :1;
        unsigned DATA3                  :1;
        unsigned DATA4                  :1;
        unsigned DATA5                  :1;
        unsigned DATA6                  :1;
        unsigned DATA7                  :1;
    };
} CRCDATALbits_t;
extern volatile CRCDATALbits_t CRCDATALbits __at(0x1C9A);
// bitfield macros
#define _CRCDATAL_DATA_POSN                                 0x0
#define _CRCDATAL_DATA_POSITION                             0x0
#define _CRCDATAL_DATA_SIZE                                 0x8
#define _CRCDATAL_DATA_LENGTH                               0x8
#define _CRCDATAL_DATA_MASK                                 0xFF
#define _CRCDATAL_DATA0_POSN                                0x0
#define _CRCDATAL_DATA0_POSITION                            0x0
#define _CRCDATAL_DATA0_SIZE                                0x1
#define _CRCDATAL_DATA0_LENGTH                              0x1
#define _CRCDATAL_DATA0_MASK                                0x1
#define _CRCDATAL_DATA1_POSN                                0x1
#define _CRCDATAL_DATA1_POSITION                            0x1
#define _CRCDATAL_DATA1_SIZE                                0x1
#define _CRCDATAL_DATA1_LENGTH                              0x1
#define _CRCDATAL_DATA1_MASK                                0x2
#define _CRCDATAL_DATA2_POSN                                0x2
#define _CRCDATAL_DATA2_POSITION                            0x2
#define _CRCDATAL_DATA2_SIZE                                0x1
#define _CRCDATAL_DATA2_LENGTH                              0x1
#define _CRCDATAL_DATA2_MASK                                0x4
#define _CRCDATAL_DATA3_POSN                                0x3
#define _CRCDATAL_DATA3_POSITION                            0x3
#define _CRCDATAL_DATA3_SIZE                                0x1
#define _CRCDATAL_DATA3_LENGTH                              0x1
#define _CRCDATAL_DATA3_MASK                                0x8
#define _CRCDATAL_DATA4_POSN                                0x4
#define _CRCDATAL_DATA4_POSITION                            0x4
#define _CRCDATAL_DATA4_SIZE                                0x1
#define _CRCDATAL_DATA4_LENGTH                              0x1
#define _CRCDATAL_DATA4_MASK                                0x10
#define _CRCDATAL_DATA5_POSN                                0x5
#define _CRCDATAL_DATA5_POSITION                            0x5
#define _CRCDATAL_DATA5_SIZE                                0x1
#define _CRCDATAL_DATA5_LENGTH                              0x1
#define _CRCDATAL_DATA5_MASK                                0x20
#define _CRCDATAL_DATA6_POSN                                0x6
#define _CRCDATAL_DATA6_POSITION                            0x6
#define _CRCDATAL_DATA6_SIZE                                0x1
#define _CRCDATAL_DATA6_LENGTH                              0x1
#define _CRCDATAL_DATA6_MASK                                0x40
#define _CRCDATAL_DATA7_POSN                                0x7
#define _CRCDATAL_DATA7_POSITION                            0x7
#define _CRCDATAL_DATA7_SIZE                                0x1
#define _CRCDATAL_DATA7_LENGTH                              0x1
#define _CRCDATAL_DATA7_MASK                                0x80

// Register: CRCDATAH
#define CRCDATAH CRCDATAH
extern volatile unsigned char           CRCDATAH            __at(0x1C9B);
#ifndef _LIB_BUILD
asm("CRCDATAH equ 01C9Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DATA                   :8;
    };
    struct {
        unsigned DATA8                  :1;
        unsigned DATA9                  :1;
        unsigned DATA10                 :1;
        unsigned DATA11                 :1;
        unsigned DATA12                 :1;
        unsigned DATA13                 :1;
        unsigned DATA14                 :1;
        unsigned DATA15                 :1;
    };
} CRCDATAHbits_t;
extern volatile CRCDATAHbits_t CRCDATAHbits __at(0x1C9B);
// bitfield macros
#define _CRCDATAH_DATA_POSN                                 0x0
#define _CRCDATAH_DATA_POSITION                             0x0
#define _CRCDATAH_DATA_SIZE                                 0x8
#define _CRCDATAH_DATA_LENGTH                               0x8
#define _CRCDATAH_DATA_MASK                                 0xFF
#define _CRCDATAH_DATA8_POSN                                0x0
#define _CRCDATAH_DATA8_POSITION                            0x0
#define _CRCDATAH_DATA8_SIZE                                0x1
#define _CRCDATAH_DATA8_LENGTH                              0x1
#define _CRCDATAH_DATA8_MASK                                0x1
#define _CRCDATAH_DATA9_POSN                                0x1
#define _CRCDATAH_DATA9_POSITION                            0x1
#define _CRCDATAH_DATA9_SIZE                                0x1
#define _CRCDATAH_DATA9_LENGTH                              0x1
#define _CRCDATAH_DATA9_MASK                                0x2
#define _CRCDATAH_DATA10_POSN                               0x2
#define _CRCDATAH_DATA10_POSITION                           0x2
#define _CRCDATAH_DATA10_SIZE                               0x1
#define _CRCDATAH_DATA10_LENGTH                             0x1
#define _CRCDATAH_DATA10_MASK                               0x4
#define _CRCDATAH_DATA11_POSN                               0x3
#define _CRCDATAH_DATA11_POSITION                           0x3
#define _CRCDATAH_DATA11_SIZE                               0x1
#define _CRCDATAH_DATA11_LENGTH                             0x1
#define _CRCDATAH_DATA11_MASK                               0x8
#define _CRCDATAH_DATA12_POSN                               0x4
#define _CRCDATAH_DATA12_POSITION                           0x4
#define _CRCDATAH_DATA12_SIZE                               0x1
#define _CRCDATAH_DATA12_LENGTH                             0x1
#define _CRCDATAH_DATA12_MASK                               0x10
#define _CRCDATAH_DATA13_POSN                               0x5
#define _CRCDATAH_DATA13_POSITION                           0x5
#define _CRCDATAH_DATA13_SIZE                               0x1
#define _CRCDATAH_DATA13_LENGTH                             0x1
#define _CRCDATAH_DATA13_MASK                               0x20
#define _CRCDATAH_DATA14_POSN                               0x6
#define _CRCDATAH_DATA14_POSITION                           0x6
#define _CRCDATAH_DATA14_SIZE                               0x1
#define _CRCDATAH_DATA14_LENGTH                             0x1
#define _CRCDATAH_DATA14_MASK                               0x40
#define _CRCDATAH_DATA15_POSN                               0x7
#define _CRCDATAH_DATA15_POSITION                           0x7
#define _CRCDATAH_DATA15_SIZE                               0x1
#define _CRCDATAH_DATA15_LENGTH                             0x1
#define _CRCDATAH_DATA15_MASK                               0x80

