GopalSaraf/Practicals/PSDL/include/proc/pic16f18115.h
extern volatile FSR1L_SHADbits_t FSR1L_SHADbits __at(0x1FEA);
// bitfield macros
#define _FSR1L_SHAD_FSR1L_SHAD_POSN                         0x0
#define _FSR1L_SHAD_FSR1L_SHAD_POSITION                     0x0
#define _FSR1L_SHAD_FSR1L_SHAD_SIZE                         0x8
#define _FSR1L_SHAD_FSR1L_SHAD_LENGTH                       0x8
#define _FSR1L_SHAD_FSR1L_SHAD_MASK                         0xFF

// Register: FSR1H_SHAD
#define FSR1H_SHAD FSR1H_SHAD
extern volatile unsigned char           FSR1H_SHAD          __at(0x1FEB);
#ifndef _LIB_BUILD
asm("FSR1H_SHAD equ 01FEBh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FSR1H_SHAD             :8;
    };
} FSR1H_SHADbits_t;
extern volatile FSR1H_SHADbits_t FSR1H_SHADbits __at(0x1FEB);
// bitfield macros
#define _FSR1H_SHAD_FSR1H_SHAD_POSN                         0x0
#define _FSR1H_SHAD_FSR1H_SHAD_POSITION                     0x0
#define _FSR1H_SHAD_FSR1H_SHAD_SIZE                         0x8
#define _FSR1H_SHAD_FSR1H_SHAD_LENGTH                       0x8
#define _FSR1H_SHAD_FSR1H_SHAD_MASK                         0xFF

// Register: STKPTR
#define STKPTR STKPTR
extern volatile unsigned char           STKPTR              __at(0x1FED);
#ifndef _LIB_BUILD
asm("STKPTR equ 01FEDh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned STKPTR0                :1;
        unsigned STKPTR1                :1;
        unsigned STKPTR2                :1;
        unsigned STKPTR3                :1;
        unsigned STKPTR4                :1;
    };
} STKPTRbits_t;
extern volatile STKPTRbits_t STKPTRbits __at(0x1FED);
// bitfield macros
#define _STKPTR_STKPTR0_POSN                                0x0
#define _STKPTR_STKPTR0_POSITION                            0x0
#define _STKPTR_STKPTR0_SIZE                                0x1
#define _STKPTR_STKPTR0_LENGTH                              0x1
#define _STKPTR_STKPTR0_MASK                                0x1
#define _STKPTR_STKPTR1_POSN                                0x1
#define _STKPTR_STKPTR1_POSITION                            0x1
#define _STKPTR_STKPTR1_SIZE                                0x1
#define _STKPTR_STKPTR1_LENGTH                              0x1
#define _STKPTR_STKPTR1_MASK                                0x2
#define _STKPTR_STKPTR2_POSN                                0x2
#define _STKPTR_STKPTR2_POSITION                            0x2
#define _STKPTR_STKPTR2_SIZE                                0x1
#define _STKPTR_STKPTR2_LENGTH                              0x1
#define _STKPTR_STKPTR2_MASK                                0x4
#define _STKPTR_STKPTR3_POSN                                0x3
#define _STKPTR_STKPTR3_POSITION                            0x3
#define _STKPTR_STKPTR3_SIZE                                0x1
#define _STKPTR_STKPTR3_LENGTH                              0x1
#define _STKPTR_STKPTR3_MASK                                0x8
#define _STKPTR_STKPTR4_POSN                                0x4
#define _STKPTR_STKPTR4_POSITION                            0x4
#define _STKPTR_STKPTR4_SIZE                                0x1
#define _STKPTR_STKPTR4_LENGTH                              0x1
#define _STKPTR_STKPTR4_MASK                                0x10

// Register: TOSL
#define TOSL TOSL
extern volatile unsigned char           TOSL                __at(0x1FEE);
#ifndef _LIB_BUILD
asm("TOSL equ 01FEEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TOSL                   :8;
    };
    struct {
        unsigned TOSL0                  :1;
        unsigned TOSL1                  :1;
        unsigned TOSL2                  :1;
        unsigned TOSL3                  :1;
        unsigned TOSL4                  :1;
        unsigned TOSL5                  :1;
        unsigned TOSL6                  :1;
        unsigned TOSL7                  :1;
    };
} TOSLbits_t;
extern volatile TOSLbits_t TOSLbits __at(0x1FEE);
// bitfield macros
#define _TOSL_TOSL_POSN                                     0x0
#define _TOSL_TOSL_POSITION                                 0x0
#define _TOSL_TOSL_SIZE                                     0x8
#define _TOSL_TOSL_LENGTH                                   0x8
#define _TOSL_TOSL_MASK                                     0xFF
#define _TOSL_TOSL0_POSN                                    0x0
#define _TOSL_TOSL0_POSITION                                0x0
#define _TOSL_TOSL0_SIZE                                    0x1
#define _TOSL_TOSL0_LENGTH                                  0x1
#define _TOSL_TOSL0_MASK                                    0x1
#define _TOSL_TOSL1_POSN                                    0x1
#define _TOSL_TOSL1_POSITION                                0x1
#define _TOSL_TOSL1_SIZE                                    0x1
#define _TOSL_TOSL1_LENGTH                                  0x1
#define _TOSL_TOSL1_MASK                                    0x2
#define _TOSL_TOSL2_POSN                                    0x2
#define _TOSL_TOSL2_POSITION                                0x2
#define _TOSL_TOSL2_SIZE                                    0x1
#define _TOSL_TOSL2_LENGTH                                  0x1
#define _TOSL_TOSL2_MASK                                    0x4
#define _TOSL_TOSL3_POSN                                    0x3
#define _TOSL_TOSL3_POSITION                                0x3
#define _TOSL_TOSL3_SIZE                                    0x1
#define _TOSL_TOSL3_LENGTH                                  0x1
#define _TOSL_TOSL3_MASK                                    0x8
#define _TOSL_TOSL4_POSN                                    0x4
#define _TOSL_TOSL4_POSITION                                0x4
#define _TOSL_TOSL4_SIZE                                    0x1
#define _TOSL_TOSL4_LENGTH                                  0x1
#define _TOSL_TOSL4_MASK                                    0x10
#define _TOSL_TOSL5_POSN                                    0x5
#define _TOSL_TOSL5_POSITION                                0x5
#define _TOSL_TOSL5_SIZE                                    0x1
#define _TOSL_TOSL5_LENGTH                                  0x1
#define _TOSL_TOSL5_MASK                                    0x20
#define _TOSL_TOSL6_POSN                                    0x6
#define _TOSL_TOSL6_POSITION                                0x6
#define _TOSL_TOSL6_SIZE                                    0x1
#define _TOSL_TOSL6_LENGTH                                  0x1
#define _TOSL_TOSL6_MASK                                    0x40
#define _TOSL_TOSL7_POSN                                    0x7
#define _TOSL_TOSL7_POSITION                                0x7
#define _TOSL_TOSL7_SIZE                                    0x1
#define _TOSL_TOSL7_LENGTH                                  0x1
#define _TOSL_TOSL7_MASK                                    0x80

// Register: TOSH
#define TOSH TOSH
extern volatile unsigned char           TOSH                __at(0x1FEF);
#ifndef _LIB_BUILD
asm("TOSH equ 01FEFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TOSH                   :8;
    };
    struct {
        unsigned TOSH0                  :1;
        unsigned TOSH1                  :1;
        unsigned TOSH2                  :1;
        unsigned TOSH3                  :1;
        unsigned TOSH4                  :1;
        unsigned TOSH5                  :1;
        unsigned TOSH6                  :1;
        unsigned TOSH7                  :1;
    };
} TOSHbits_t;
