GopalSaraf/Practicals/PSDL/include/proc/pic16f18115.h
#define                                 ODCA5_bit           _BIT_ACCESS(ODCONA,5)
// DAC1CON<OE0>
extern volatile __bit                   OE0                 __at(0x4464);	// @ (0x88C * 8 + 4)
#define                                 OE0_bit             _BIT_ACCESS(DAC1CON,4)
// DAC1CON<OE1>
extern volatile __bit                   OE1                 __at(0x4465);	// @ (0x88C * 8 + 5)
#define                                 OE1_bit             _BIT_ACCESS(DAC1CON,5)
// OSCCON3<ORDY>
extern volatile __bit                   ORDY                __at(0x147C);	// @ (0x28F * 8 + 4)
#define                                 ORDY_bit            _BIT_ACCESS(OSCCON3,4)
// PIE1<OSFIE>
extern volatile __bit                   OSFIE               __at(0x4BD);	// @ (0x97 * 8 + 5)
#define                                 OSFIE_bit           _BIT_ACCESS(PIE1,5)
// PIR1<OSFIF>
extern volatile __bit                   OSFIF               __at(0x46D);	// @ (0x8D * 8 + 5)
#define                                 OSFIF_bit           _BIT_ACCESS(PIR1,5)
// CRCOUTL<OUT0>
extern volatile __bit                   OUT0                __at(0xE4F0);	// @ (0x1C9E * 8 + 0)
#define                                 OUT0_bit            _BIT_ACCESS(CRCOUTL,0)
// CRCOUTL<OUT1>
extern volatile __bit                   OUT1                __at(0xE4F1);	// @ (0x1C9E * 8 + 1)
#define                                 OUT1_bit            _BIT_ACCESS(CRCOUTL,1)
// CRCOUTH<OUT10>
extern volatile __bit                   OUT10               __at(0xE4FA);	// @ (0x1C9F * 8 + 2)
#define                                 OUT10_bit           _BIT_ACCESS(CRCOUTH,2)
// CRCOUTH<OUT11>
extern volatile __bit                   OUT11               __at(0xE4FB);	// @ (0x1C9F * 8 + 3)
#define                                 OUT11_bit           _BIT_ACCESS(CRCOUTH,3)
// CRCOUTH<OUT12>
extern volatile __bit                   OUT12               __at(0xE4FC);	// @ (0x1C9F * 8 + 4)
#define                                 OUT12_bit           _BIT_ACCESS(CRCOUTH,4)
// CRCOUTH<OUT13>
extern volatile __bit                   OUT13               __at(0xE4FD);	// @ (0x1C9F * 8 + 5)
#define                                 OUT13_bit           _BIT_ACCESS(CRCOUTH,5)
// CRCOUTH<OUT14>
extern volatile __bit                   OUT14               __at(0xE4FE);	// @ (0x1C9F * 8 + 6)
#define                                 OUT14_bit           _BIT_ACCESS(CRCOUTH,6)
// CRCOUTH<OUT15>
extern volatile __bit                   OUT15               __at(0xE4FF);	// @ (0x1C9F * 8 + 7)
#define                                 OUT15_bit           _BIT_ACCESS(CRCOUTH,7)
// CRCOUTU<OUT16>
extern volatile __bit                   OUT16               __at(0xE500);	// @ (0x1CA0 * 8 + 0)
#define                                 OUT16_bit           _BIT_ACCESS(CRCOUTU,0)
// CRCOUTU<OUT17>
extern volatile __bit                   OUT17               __at(0xE501);	// @ (0x1CA0 * 8 + 1)
#define                                 OUT17_bit           _BIT_ACCESS(CRCOUTU,1)
// CRCOUTU<OUT18>
extern volatile __bit                   OUT18               __at(0xE502);	// @ (0x1CA0 * 8 + 2)
#define                                 OUT18_bit           _BIT_ACCESS(CRCOUTU,2)
// CRCOUTU<OUT19>
extern volatile __bit                   OUT19               __at(0xE503);	// @ (0x1CA0 * 8 + 3)
#define                                 OUT19_bit           _BIT_ACCESS(CRCOUTU,3)
// CRCOUTL<OUT2>
extern volatile __bit                   OUT2                __at(0xE4F2);	// @ (0x1C9E * 8 + 2)
#define                                 OUT2_bit            _BIT_ACCESS(CRCOUTL,2)
// CRCOUTU<OUT20>
extern volatile __bit                   OUT20               __at(0xE504);	// @ (0x1CA0 * 8 + 4)
#define                                 OUT20_bit           _BIT_ACCESS(CRCOUTU,4)
// CRCOUTU<OUT21>
extern volatile __bit                   OUT21               __at(0xE505);	// @ (0x1CA0 * 8 + 5)
#define                                 OUT21_bit           _BIT_ACCESS(CRCOUTU,5)
// CRCOUTU<OUT22>
extern volatile __bit                   OUT22               __at(0xE506);	// @ (0x1CA0 * 8 + 6)
#define                                 OUT22_bit           _BIT_ACCESS(CRCOUTU,6)
// CRCOUTU<OUT23>
extern volatile __bit                   OUT23               __at(0xE507);	// @ (0x1CA0 * 8 + 7)
#define                                 OUT23_bit           _BIT_ACCESS(CRCOUTU,7)
// CRCOUTT<OUT24>
extern volatile __bit                   OUT24               __at(0xE508);	// @ (0x1CA1 * 8 + 0)
#define                                 OUT24_bit           _BIT_ACCESS(CRCOUTT,0)
// CRCOUTT<OUT25>
extern volatile __bit                   OUT25               __at(0xE509);	// @ (0x1CA1 * 8 + 1)
#define                                 OUT25_bit           _BIT_ACCESS(CRCOUTT,1)
// CRCOUTT<OUT26>
extern volatile __bit                   OUT26               __at(0xE50A);	// @ (0x1CA1 * 8 + 2)
#define                                 OUT26_bit           _BIT_ACCESS(CRCOUTT,2)
// CRCOUTT<OUT27>
extern volatile __bit                   OUT27               __at(0xE50B);	// @ (0x1CA1 * 8 + 3)
#define                                 OUT27_bit           _BIT_ACCESS(CRCOUTT,3)
// CRCOUTT<OUT28>
extern volatile __bit                   OUT28               __at(0xE50C);	// @ (0x1CA1 * 8 + 4)
#define                                 OUT28_bit           _BIT_ACCESS(CRCOUTT,4)
// CRCOUTT<OUT29>
extern volatile __bit                   OUT29               __at(0xE50D);	// @ (0x1CA1 * 8 + 5)
#define                                 OUT29_bit           _BIT_ACCESS(CRCOUTT,5)
// CRCOUTL<OUT3>
extern volatile __bit                   OUT3                __at(0xE4F3);	// @ (0x1C9E * 8 + 3)
#define                                 OUT3_bit            _BIT_ACCESS(CRCOUTL,3)
// CRCOUTT<OUT30>
extern volatile __bit                   OUT30               __at(0xE50E);	// @ (0x1CA1 * 8 + 6)
#define                                 OUT30_bit           _BIT_ACCESS(CRCOUTT,6)
// CRCOUTT<OUT31>
extern volatile __bit                   OUT31               __at(0xE50F);	// @ (0x1CA1 * 8 + 7)
#define                                 OUT31_bit           _BIT_ACCESS(CRCOUTT,7)
// CRCOUTL<OUT4>
extern volatile __bit                   OUT4                __at(0xE4F4);	// @ (0x1C9E * 8 + 4)
#define                                 OUT4_bit            _BIT_ACCESS(CRCOUTL,4)
// CRCOUTL<OUT5>
extern volatile __bit                   OUT5                __at(0xE4F5);	// @ (0x1C9E * 8 + 5)
#define                                 OUT5_bit            _BIT_ACCESS(CRCOUTL,5)
// CRCOUTL<OUT6>
extern volatile __bit                   OUT6                __at(0xE4F6);	// @ (0x1C9E * 8 + 6)
#define                                 OUT6_bit            _BIT_ACCESS(CRCOUTL,6)
// CRCOUTL<OUT7>
extern volatile __bit                   OUT7                __at(0xE4F7);	// @ (0x1C9E * 8 + 7)
#define                                 OUT7_bit            _BIT_ACCESS(CRCOUTL,7)
// CRCOUTH<OUT8>
extern volatile __bit                   OUT8                __at(0xE4F8);	// @ (0x1C9F * 8 + 0)
#define                                 OUT8_bit            _BIT_ACCESS(CRCOUTH,0)
// CRCOUTH<OUT9>
extern volatile __bit                   OUT9                __at(0xE4F9);	// @ (0x1C9F * 8 + 1)
#define                                 OUT9_bit            _BIT_ACCESS(CRCOUTH,1)
// CWG1STR<OVRA>
extern volatile __bit                   OVRA                __at(0x30A4);	// @ (0x614 * 8 + 4)
#define                                 OVRA_bit            _BIT_ACCESS(CWG1STR,4)
// CWG1STR<OVRB>
extern volatile __bit                   OVRB                __at(0x30A5);	// @ (0x614 * 8 + 5)
#define                                 OVRB_bit            _BIT_ACCESS(CWG1STR,5)
// CWG1STR<OVRC>
extern volatile __bit                   OVRC                __at(0x30A6);	// @ (0x614 * 8 + 6)
#define                                 OVRC_bit            _BIT_ACCESS(CWG1STR,6)
// CWG1STR<OVRD>
extern volatile __bit                   OVRD                __at(0x30A7);	// @ (0x614 * 8 + 7)
#define                                 OVRD_bit            _BIT_ACCESS(CWG1STR,7)
// CCP1CON<P1M1>
extern volatile __bit                   P1M1                __at(0x2077);	// @ (0x40E * 8 + 7)
#define                                 P1M1_bit            _BIT_ACCESS(CCP1CON,7)
// CCP2CON<P2M1>
extern volatile __bit                   P2M1                __at(0x2097);	// @ (0x412 * 8 + 7)
#define                                 P2M1_bit            _BIT_ACCESS(CCP2CON,7)
// ADPCH<PCH3>
extern volatile __bit                   PCH3                __at(0xE8FB);	// @ (0x1D1F * 8 + 3)
#define                                 PCH3_bit            _BIT_ACCESS(ADPCH,3)
// ADPCH<PCH4>
extern volatile __bit                   PCH4                __at(0xE8FC);	// @ (0x1D1F * 8 + 4)
#define                                 PCH4_bit            _BIT_ACCESS(ADPCH,4)
// ADPCH<PCH5>
extern volatile __bit                   PCH5                __at(0xE8FD);	// @ (0x1D1F * 8 + 5)
#define                                 PCH5_bit            _BIT_ACCESS(ADPCH,5)
// ADCON1<PCSC>
extern volatile __bit                   PCSC                __at(0xE939);	// @ (0x1D27 * 8 + 1)
#define                                 PCSC_bit            _BIT_ACCESS(ADCON1,1)
// INTCON<PEIE>
extern volatile __bit                   PEIE                __at(0x5E);	// @ (0xB * 8 + 6)
#define                                 PEIE_bit            _BIT_ACCESS(INTCON,6)
// SSP1CON2<PEN1>
extern volatile __bit                   PEN1                __at(0x3C8A);	// @ (0x791 * 8 + 2)
#define                                 PEN1_bit            _BIT_ACCESS(SSP1CON2,2)
// SSP2CON2<PEN2>
extern volatile __bit                   PEN2                __at(0x3CDA);	// @ (0x79B * 8 + 2)
#define                                 PEN2_bit            _BIT_ACCESS(SSP2CON2,2)
// NCO1CON<PFM>
extern volatile __bit                   PFM                 __at(0x2C90);	// @ (0x592 * 8 + 0)
#define                                 PFM_bit             _BIT_ACCESS(NCO1CON,0)
// CRCCON1<PLEN0>
extern volatile __bit                   PLEN0               __at(0xE518);	// @ (0x1CA3 * 8 + 0)
#define                                 PLEN0_bit           _BIT_ACCESS(CRCCON1,0)
// CRCCON1<PLEN1>
extern volatile __bit                   PLEN1               __at(0xE519);	// @ (0x1CA3 * 8 + 1)
#define                                 PLEN1_bit           _BIT_ACCESS(CRCCON1,1)
// CRCCON1<PLEN2>
extern volatile __bit                   PLEN2               __at(0xE51A);	// @ (0x1CA3 * 8 + 2)
#define                                 PLEN2_bit           _BIT_ACCESS(CRCCON1,2)
// CRCCON1<PLEN3>
extern volatile __bit                   PLEN3               __at(0xE51B);	// @ (0x1CA3 * 8 + 3)
#define                                 PLEN3_bit           _BIT_ACCESS(CRCCON1,3)
// CRCCON1<PLEN4>
extern volatile __bit                   PLEN4               __at(0xE51C);	// @ (0x1CA3 * 8 + 4)
#define                                 PLEN4_bit           _BIT_ACCESS(CRCCON1,4)
// OSCEN<PLLEN>
extern volatile __bit                   PLLEN               __at(0x1488);	// @ (0x291 * 8 + 0)
#define                                 PLLEN_bit           _BIT_ACCESS(OSCEN,0)
// OSCSTAT<PLLR>
extern volatile __bit                   PLLR                __at(0x1480);	// @ (0x290 * 8 + 0)
#define                                 PLLR_bit            _BIT_ACCESS(OSCSTAT,0)
// CWG1CON1<POLA>
extern volatile __bit                   POLA                __at(0x3088);	// @ (0x611 * 8 + 0)
#define                                 POLA_bit            _BIT_ACCESS(CWG1CON1,0)
// CWG1CON1<POLB>
extern volatile __bit                   POLB                __at(0x3089);	// @ (0x611 * 8 + 1)
#define                                 POLB_bit            _BIT_ACCESS(CWG1CON1,1)
// CWG1CON1<POLC>
extern volatile __bit                   POLC                __at(0x308A);	// @ (0x611 * 8 + 2)
#define                                 POLC_bit            _BIT_ACCESS(CWG1CON1,2)
// CWG1CON1<POLD>
extern volatile __bit                   POLD                __at(0x308B);	// @ (0x611 * 8 + 3)
#define                                 POLD_bit            _BIT_ACCESS(CWG1CON1,3)
// ADCON1<PPOL>
extern volatile __bit                   PPOL                __at(0xE93F);	// @ (0x1D27 * 8 + 7)
#define                                 PPOL_bit            _BIT_ACCESS(ADCON1,7)
// PPSLOCK<PPSLOCKED>
extern volatile __bit                   PPSLOCKED           __at(0xF060);	// @ (0x1E0C * 8 + 0)
#define                                 PPSLOCKED_bit       _BIT_ACCESS(PPSLOCK,0)
// ADPREL<PRE0>
extern volatile __bit                   PRE0                __at(0xE920);	// @ (0x1D24 * 8 + 0)
#define                                 PRE0_bit            _BIT_ACCESS(ADPREL,0)
// ADPREL<PRE1>
extern volatile __bit                   PRE1                __at(0xE921);	// @ (0x1D24 * 8 + 1)
#define                                 PRE1_bit            _BIT_ACCESS(ADPREL,1)
// ADPREH<PRE10>
extern volatile __bit                   PRE10               __at(0xE92A);	// @ (0x1D25 * 8 + 2)
#define                                 PRE10_bit           _BIT_ACCESS(ADPREH,2)
// ADPREH<PRE11>
extern volatile __bit                   PRE11               __at(0xE92B);	// @ (0x1D25 * 8 + 3)
#define                                 PRE11_bit           _BIT_ACCESS(ADPREH,3)
// ADPREH<PRE12>
extern volatile __bit                   PRE12               __at(0xE92C);	// @ (0x1D25 * 8 + 4)
#define                                 PRE12_bit           _BIT_ACCESS(ADPREH,4)
// ADPREL<PRE2>
extern volatile __bit                   PRE2                __at(0xE922);	// @ (0x1D24 * 8 + 2)
#define                                 PRE2_bit            _BIT_ACCESS(ADPREL,2)
// ADPREL<PRE3>
extern volatile __bit                   PRE3                __at(0xE923);	// @ (0x1D24 * 8 + 3)
#define                                 PRE3_bit            _BIT_ACCESS(ADPREL,3)
// ADPREL<PRE4>
extern volatile __bit                   PRE4                __at(0xE924);	// @ (0x1D24 * 8 + 4)
#define                                 PRE4_bit            _BIT_ACCESS(ADPREL,4)
// ADPREL<PRE5>
extern volatile __bit                   PRE5                __at(0xE925);	// @ (0x1D24 * 8 + 5)
#define                                 PRE5_bit            _BIT_ACCESS(ADPREL,5)
// ADPREL<PRE6>
extern volatile __bit                   PRE6                __at(0xE926);	// @ (0x1D24 * 8 + 6)
#define                                 PRE6_bit            _BIT_ACCESS(ADPREL,6)
// ADPREL<PRE7>
extern volatile __bit                   PRE7                __at(0xE927);	// @ (0x1D24 * 8 + 7)
#define                                 PRE7_bit            _BIT_ACCESS(ADPREL,7)
// ADPREH<PRE8>
extern volatile __bit                   PRE8                __at(0xE928);	// @ (0x1D25 * 8 + 0)
#define                                 PRE8_bit            _BIT_ACCESS(ADPREH,0)
// ADPREH<PRE9>
extern volatile __bit                   PRE9                __at(0xE929);	// @ (0x1D25 * 8 + 1)
#define                                 PRE9_bit            _BIT_ACCESS(ADPREH,1)
// ADREF<PREF0>
extern volatile __bit                   PREF0               __at(0xE958);	// @ (0x1D2B * 8 + 0)
#define                                 PREF0_bit           _BIT_ACCESS(ADREF,0)
// ADREF<PREF1>
extern volatile __bit                   PREF1               __at(0xE959);	// @ (0x1D2B * 8 + 1)
#define                                 PREF1_bit           _BIT_ACCESS(ADREF,1)
// ADPREVL<PREV0>
extern volatile __bit                   PREV0               __at(0xE8D8);	// @ (0x1D1B * 8 + 0)
#define                                 PREV0_bit           _BIT_ACCESS(ADPREVL,0)
// ADPREVL<PREV1>
extern volatile __bit                   PREV1               __at(0xE8D9);	// @ (0x1D1B * 8 + 1)
#define                                 PREV1_bit           _BIT_ACCESS(ADPREVL,1)
// ADPREVH<PREV10>
extern volatile __bit                   PREV10              __at(0xE8E2);	// @ (0x1D1C * 8 + 2)
#define                                 PREV10_bit          _BIT_ACCESS(ADPREVH,2)
// ADPREVH<PREV11>
extern volatile __bit                   PREV11              __at(0xE8E3);	// @ (0x1D1C * 8 + 3)
#define                                 PREV11_bit          _BIT_ACCESS(ADPREVH,3)
// ADPREVH<PREV12>
extern volatile __bit                   PREV12              __at(0xE8E4);	// @ (0x1D1C * 8 + 4)
#define                                 PREV12_bit          _BIT_ACCESS(ADPREVH,4)
// ADPREVH<PREV13>
extern volatile __bit                   PREV13              __at(0xE8E5);	// @ (0x1D1C * 8 + 5)
#define                                 PREV13_bit          _BIT_ACCESS(ADPREVH,5)
// ADPREVH<PREV14>
extern volatile __bit                   PREV14              __at(0xE8E6);	// @ (0x1D1C * 8 + 6)
#define                                 PREV14_bit          _BIT_ACCESS(ADPREVH,6)
// ADPREVH<PREV15>
extern volatile __bit                   PREV15              __at(0xE8E7);	// @ (0x1D1C * 8 + 7)
#define                                 PREV15_bit          _BIT_ACCESS(ADPREVH,7)
// ADPREVL<PREV2>
extern volatile __bit                   PREV2               __at(0xE8DA);	// @ (0x1D1B * 8 + 2)
#define                                 PREV2_bit           _BIT_ACCESS(ADPREVL,2)
// ADPREVL<PREV3>
extern volatile __bit                   PREV3               __at(0xE8DB);	// @ (0x1D1B * 8 + 3)
#define                                 PREV3_bit           _BIT_ACCESS(ADPREVL,3)
// ADPREVL<PREV4>
extern volatile __bit                   PREV4               __at(0xE8DC);	// @ (0x1D1B * 8 + 4)
#define                                 PREV4_bit           _BIT_ACCESS(ADPREVL,4)
// ADPREVL<PREV5>
extern volatile __bit                   PREV5               __at(0xE8DD);	// @ (0x1D1B * 8 + 5)
#define                                 PREV5_bit           _BIT_ACCESS(ADPREVL,5)
// ADPREVL<PREV6>
extern volatile __bit                   PREV6               __at(0xE8DE);	// @ (0x1D1B * 8 + 6)
#define                                 PREV6_bit           _BIT_ACCESS(ADPREVL,6)
// ADPREVL<PREV7>
extern volatile __bit                   PREV7               __at(0xE8DF);	// @ (0x1D1B * 8 + 7)
#define                                 PREV7_bit           _BIT_ACCESS(ADPREVL,7)
// ADPREVH<PREV8>
extern volatile __bit                   PREV8               __at(0xE8E0);	// @ (0x1D1C * 8 + 0)
#define                                 PREV8_bit           _BIT_ACCESS(ADPREVH,0)
// ADPREVH<PREV9>
extern volatile __bit                   PREV9               __at(0xE8E1);	// @ (0x1D1C * 8 + 1)
#define                                 PREV9_bit           _BIT_ACCESS(ADPREVH,1)
// WDTCON0<PS0>
extern volatile __bit                   PS0                 __at(0xC61);	// @ (0x18C * 8 + 1)
#define                                 PS0_bit             _BIT_ACCESS(WDTCON0,1)
// WDTCON0<PS1>
extern volatile __bit                   PS1                 __at(0xC62);	// @ (0x18C * 8 + 2)
#define                                 PS1_bit             _BIT_ACCESS(WDTCON0,2)
// WDTCON0<PS2>
extern volatile __bit                   PS2                 __at(0xC63);	// @ (0x18C * 8 + 3)
#define                                 PS2_bit             _BIT_ACCESS(WDTCON0,3)
// WDTCON0<PS3>
extern volatile __bit                   PS3                 __at(0xC64);	// @ (0x18C * 8 + 4)
#define                                 PS3_bit             _BIT_ACCESS(WDTCON0,4)
// WDTCON0<PS4>
extern volatile __bit                   PS4                 __at(0xC65);	// @ (0x18C * 8 + 5)
#define                                 PS4_bit             _BIT_ACCESS(WDTCON0,5)
// WDTPSL<PSCNT0>
extern volatile __bit                   PSCNT0              __at(0xC70);	// @ (0x18E * 8 + 0)
#define                                 PSCNT0_bit          _BIT_ACCESS(WDTPSL,0)
// WDTPSL<PSCNT1>
extern volatile __bit                   PSCNT1              __at(0xC71);	// @ (0x18E * 8 + 1)
#define                                 PSCNT1_bit          _BIT_ACCESS(WDTPSL,1)
// WDTPSH<PSCNT10>
extern volatile __bit                   PSCNT10             __at(0xC7A);	// @ (0x18F * 8 + 2)
#define                                 PSCNT10_bit         _BIT_ACCESS(WDTPSH,2)
// WDTPSH<PSCNT11>
extern volatile __bit                   PSCNT11             __at(0xC7B);	// @ (0x18F * 8 + 3)
#define                                 PSCNT11_bit         _BIT_ACCESS(WDTPSH,3)
// WDTPSH<PSCNT12>
extern volatile __bit                   PSCNT12             __at(0xC7C);	// @ (0x18F * 8 + 4)
#define                                 PSCNT12_bit         _BIT_ACCESS(WDTPSH,4)
// WDTPSH<PSCNT13>
extern volatile __bit                   PSCNT13             __at(0xC7D);	// @ (0x18F * 8 + 5)
#define                                 PSCNT13_bit         _BIT_ACCESS(WDTPSH,5)
// WDTPSH<PSCNT14>
extern volatile __bit                   PSCNT14             __at(0xC7E);	// @ (0x18F * 8 + 6)
#define                                 PSCNT14_bit         _BIT_ACCESS(WDTPSH,6)
// WDTPSH<PSCNT15>
extern volatile __bit                   PSCNT15             __at(0xC7F);	// @ (0x18F * 8 + 7)
#define                                 PSCNT15_bit         _BIT_ACCESS(WDTPSH,7)
// WDTTMR<PSCNT16>
extern volatile __bit                   PSCNT16             __at(0xC80);	// @ (0x190 * 8 + 0)
#define                                 PSCNT16_bit         _BIT_ACCESS(WDTTMR,0)
// WDTTMR<PSCNT17>
extern volatile __bit                   PSCNT17             __at(0xC81);	// @ (0x190 * 8 + 1)
#define                                 PSCNT17_bit         _BIT_ACCESS(WDTTMR,1)
// WDTPSL<PSCNT2>
extern volatile __bit                   PSCNT2              __at(0xC72);	// @ (0x18E * 8 + 2)
#define                                 PSCNT2_bit          _BIT_ACCESS(WDTPSL,2)
// WDTPSL<PSCNT3>
extern volatile __bit                   PSCNT3              __at(0xC73);	// @ (0x18E * 8 + 3)
#define                                 PSCNT3_bit          _BIT_ACCESS(WDTPSL,3)
// WDTPSL<PSCNT4>
extern volatile __bit                   PSCNT4              __at(0xC74);	// @ (0x18E * 8 + 4)
#define                                 PSCNT4_bit          _BIT_ACCESS(WDTPSL,4)
// WDTPSL<PSCNT5>
extern volatile __bit                   PSCNT5              __at(0xC75);	// @ (0x18E * 8 + 5)
#define                                 PSCNT5_bit          _BIT_ACCESS(WDTPSL,5)
// WDTPSL<PSCNT6>
extern volatile __bit                   PSCNT6              __at(0xC76);	// @ (0x18E * 8 + 6)
#define                                 PSCNT6_bit          _BIT_ACCESS(WDTPSL,6)
// WDTPSL<PSCNT7>
extern volatile __bit                   PSCNT7              __at(0xC77);	// @ (0x18E * 8 + 7)
#define                                 PSCNT7_bit          _BIT_ACCESS(WDTPSL,7)
// WDTPSH<PSCNT8>
extern volatile __bit                   PSCNT8              __at(0xC78);	// @ (0x18F * 8 + 0)
#define                                 PSCNT8_bit          _BIT_ACCESS(WDTPSH,0)
// WDTPSH<PSCNT9>
extern volatile __bit                   PSCNT9              __at(0xC79);	// @ (0x18F * 8 + 1)
#define                                 PSCNT9_bit          _BIT_ACCESS(WDTPSH,1)
// ADCON2<PSIS>
extern volatile __bit                   PSIS                __at(0xE947);	// @ (0x1D28 * 8 + 7)
#define                                 PSIS_bit            _BIT_ACCESS(ADCON2,7)
// PIE3<PWM1IE>
extern volatile __bit                   PWM1IE              __at(0x4C9);	// @ (0x99 * 8 + 1)
#define                                 PWM1IE_bit          _BIT_ACCESS(PIE3,1)
// PIR3<PWM1IF>
extern volatile __bit                   PWM1IF              __at(0x479);	// @ (0x8F * 8 + 1)
#define                                 PWM1IF_bit          _BIT_ACCESS(PIR3,1)
// PMD1<PWM1MD>
extern volatile __bit                   PWM1MD              __at(0x86F);	// @ (0x10D * 8 + 7)
#define                                 PWM1MD_bit          _BIT_ACCESS(PMD1,7)
// PIE3<PWM1PIE>
